{"org": 5826, "apache": 298, "jasper": 4547, "runtime": 7303, "bodycontentimpl": 747, "causing": 998, "memory": 5136, "inner": 4210, "classes": 1190, "explicitly": 2559, "referenced": 6817, "nio": 5449, "blockpoller": 738, "events": 2439, "method": 5186, "long": 4887, "time": 8938, "unpackwars": 9488, "false": 2629, "causes": 997, "different": 2072, "behavior": 681, "classloader": 1193, "entry": 2360, "managerservlet": 4947, "listed": 4803, "catalina": 975, "manager": 4940, "properties": 6461, "class": 1179, "loading": 4827, "case": 970, "occurs": 5686, "sending": 7497, "closing": 1292, "session": 7621, "websocket": 9858, "send": 7470, "blocks": 739, "indefinitely": 4148, "futuretosendhandler": 2925, "change": 1067, "log": 4857, "level": 4761, "sessionidgeneratorbase": 7651, "createrandom": 1697, "warn": 9816, "info": 4171, "attributes": 532, "host": 3995, "application": 320, "security": 7437, "importhandler": 4118, "using": 9657, "wrong": 9938, "key": 4665, "cache": 893, "resolved": 7098, "exception": 2468, "passed": 6007, "catch": 991, "custom": 1743, "jsp": 4608, "tag": 8806, "ibm": 4064, "jdk": 4577, "results": 7169, "nullpointerexception": 5623, "requests": 7061, "jsps": 4625, "rmi": 7234, "leak": 4742, "cleaning": 1213, "thread": 8903, "safe": 7316, "ssl": 8396, "handshake": 3910, "implementation": 4106, "handle": 3897, "sslengineresult": 8517, "status": 8621, "buffer_overflow": 794, "state": 8604, "stream": 8654, "closed": 1271, "reading": 6676, "war": 9813, "failed": 2604, "ldap": 4739, "connection": 1483, "triggers": 9111, "realm": 6719, "rewritevalve": 7214, "add": 145, "logging": 4866, "support": 8726, "similar": 8185, "mod": 5249, "rewrite": 7211, "improve": 4122, "error": 2390, "message": 5152, "attribute": 526, "load": 4819, "deserialization": 2015, "problems": 6383, "web": 9832, "inf": 4167, "lib": 4765, "working": 9889, "tomcat": 9021, "passwduserdatabase": 6015, "parsing": 5993, "passwd": 6014, "line": 4790, "jndi": 4592, "datasource": 1763, "lookup": 4896, "failure": 2618, "throws": 8931, "javax": 4570, "naming": 5351, "namingexception": 5354, "non": 5512, "ascii": 404, "characters": 1095, "querystring": 6590, "url": 9569, "el": 2251, "function": 2913, "resolve": 7096, "varargs": 9747, "values": 9736, "cors": 1652, "filter": 2696, "allowing": 259, "origin": 5828, "file": 2668, "resource": 7106, "access": 85, "allow": 249, "nested": 5390, "jar": 4525, "scanning": 7377, "filtered": 2708, "property": 6463, "reports": 7002, "null": 5617, "close": 1263, "reason": 6731, "operation": 5793, "timed": 8940, "readline": 6680, "io": 4360, "multi": 5304, "post": 6273, "exactly": 2457, "bytes": 871, "webdav": 9843, "fails": 2616, "windows": 9877, "lockoutrealm": 4855, "details": 2044, "invalid": 4310, "pattern": 6034, "servlet": 7586, "mapping": 4976, "manifest": 4951, "errors": 2405, "resolving": 7103, "entries": 2359, "provide": 6507, "way": 9826, "disable": 2101, "server": 7545, "header": 3950, "completely": 1409, "npe": 5600, "tldscanner": 8972, "tldscannercallback": 8973, "scanwebinfclasses": 7380, "standardjarscanner": 8579, "jars": 4540, "path": 6022, "nullpointer": 5622, "mapper": 4973, "java": 4556, "content": 1576, "language": 4713, "headers": 3962, "created": 1683, "response": 7132, "setlocale": 7871, "fully": 2907, "represent": 7006, "locale": 4835, "asynccontextimpl": 461, "breaks": 779, "request": 7029, "containing": 1570, "spaces": 8341, "onerror": 5728, "called": 923, "async": 435, "processing": 6414, "oncomplete": 5723, "timeout": 8944, "buffer": 793, "flushed": 2808, "upgrade": 9541, "processor": 6419, "recycledprocessors": 6786, "stack": 8562, "http11nioprotocol": 4028, "http11connectionhandler": 4023, "lang": 4710, "runtimepermission": 7308, "warning": 9817, "slf4j": 8239, "default": 1826, "jarstoskip": 4543, "value": 9722, "dispatch": 2121, "cross": 1722, "context": 1582, "forward": 2855, "push": 6550, "example": 2461, "nosuchmethodexception": 5556, "net": 5392, "sslparameters": 8532, "setuseciphersuitesorder": 8110, "start": 8589, "xml": 9973, "conf": 1446, "prevents": 6340, "redeployment": 6790, "startup": 8603, "webappclassloaderbase": 9837, "store": 8637, "merged": 5145, "singlesignon": 8203, "valve": 9739, "missing": 5234, "invoking": 4359, "httpservletrequest": 4049, "logout": 4883, "sh": 8133, "check": 1115, "colon": 1336, "work": 9885, "double": 2185, "quotes": 6609, "filenames": 2679, "illegalargumentexception": 4095, "connector": 1512, "sendredirect": 7506, "uri": 9557, "blank": 729, "create": 1679, "configuration": 1462, "write": 9904, "relative": 6877, "responses": 7145, "instead": 4256, "absolute": 57, "memoryrealm": 5139, "upgrading": 9554, "loop": 4898, "apr": 350, "poller": 6186, "shutdown": 8158, "arrayindexoutofboundsexception": 396, "contains": 1571, "byte": 856, "performance": 6071, "issue": 4487, "tags": 8827, "calls": 930, "forname": 2853, "forced": 2833, "client": 1236, "read": 6646, "secure": 7430, "proxy": 6515, "ok": 5703, "base": 630, "use": 9594, "user": 9613, "home": 3991, "uninstaller": 9464, "link": 4795, "contents": 1580, "applicationhttprequest": 331, "enforce": 2342, "parametermap": 5936, "illegalstateexception": 4097, "calling": 928, "httpservletresponse": 4050, "remoteipfilter": 6918, "returned": 7192, "mode": 5253, "reloading": 6894, "initialization": 4191, "problem": 6382, "classpath": 1203, "urls": 9581, "cause": 995, "abort": 53, "webapps": 9840, "lines": 4794, "written": 9936, "behaviour": 682, "senderror": 7482, "times": 8953, "query": 6582, "string": 8671, "parameters": 5938, "sent": 7518, "dest": 2026, "getrequestdispatcher": 3662, "infinite": 4168, "redeploy": 6789, "true": 9122, "http": 4019, "clientendpoint": 1247, "patch": 6021, "util": 9672, "concurrent": 1435, "executionexception": 2501, "ioexception": 4365, "cancelled": 940, "undeploy": 9449, "spec": 8348, "conflict": 1477, "static": 8617, "fields": 2664, "methods": 5193, "real": 6714, "docbase": 2154, "embedded": 2275, "searches": 7415, "web_inf": 9834, "setwritelistener": 8128, "runnable": 7299, "asynccontext": 459, "resolveclass": 7097, "report": 6996, "import": 4115, "repeatedly": 6969, "used": 9605, "plugin": 6162, "environments": 2370, "based": 632, "oracle": 5815, "throw": 8927, "encodeexception": 2304, "basic": 641, "sendobject": 7503, "sessionidgenerator": 7650, "element": 2257, "lost": 4901, "reload": 6891, "group": 3857, "accept": 79, "integer": 4261, "follow": 2821, "compile": 1398, "fail": 2602, "returning": 7194, "properly": 6460, "specifies": 8356, "utf": 9666, "encoding": 2312, "cookie": 1626, "version": 9770, "number": 5637, "jdbc": 4573, "pool": 6204, "building": 844, "sign": 8165, "binaries": 701, "v1": 9684, "generated": 2950, "separator": 7526, "allow_http_separators_in_v0": 251, "implement": 4105, "rfc6265": 7225, "hexutils": 3982, "test": 8868, "hex": 3979, "codebase": 1313, "associated": 427, "classname": 1199, "information": 4175, "webappclassloader": 9836, "loadclass": 4820, "synchronization": 8791, "lock": 4852, "instance": 4230, "stuck": 8687, "threads": 8920, "stuckthreaddetectionvalve": 8689, "jmx": 4584, "getnegotiatedextensions": 3522, "return": 7191, "list": 4802, "permessage": 6081, "deflate": 1930, "enabled": 2288, "jsp_file": 4610, "needs": 5381, "single": 8198, "applications": 339, "paths": 6030, "updated": 9531, "leaks": 4743, "cid": 1165, "unable": 9435, "destroy": 2031, "examples": 2462, "webapp": 9835, "comma": 1368, "defaultservlet": 1903, "copy": 1638, "incompatible": 4137, "permit": 6085, "head": 3949, "currently": 1735, "unavailable": 9438, "include": 4127, "service": 7571, "scripts": 7404, "microsoft": 5203, "installer": 4228, "package": 5888, "ant": 296, "target": 8832, "processannotationsfile": 6392, "avoid": 588, "sleep": 8235, "usage": 9588, "threadpoolexecutor": 8917, "tld": 8963, "files": 2686, "refers": 6820, "defaultjarscanner": 1888, "set": 7667, "restart": 7150, "container": 1564, "background": 602, "concurrency": 1434, "wrapper": 9894, "mappings": 4980, "openssl": 5773, "syntax": 8795, "cipher": 1167, "suite": 8715, "jsse": 4634, "connectors": 1514, "rfc": 7217, "conform": 1478, "delayed": 1935, "operations": 5795, "sessions": 7659, "backed": 599, "persistentmanager": 6100, "signatures": 8170, "arrays": 399, "arguments": 387, "checkinterval": 1126, "existant": 2512, "standardmanager": 8580, "stores": 8649, "code": 1312, "clears": 1232, "sso": 8558, "data": 1755, "inputstream": 4219, "ondataavailable": 5726, "engine": 2343, "getservice": 3701, "getparent": 3564, "findconnectors": 2740, "serversocketchannel": 7566, "addr": 179, "setproperties": 7968, "open": 5761, "getport": 3612, "socketproperties": 8297, "new": 5406, "inetsocketaddress": 4166, "getaddress": 2985, "serversock": 7564, "socket": 8283, "bind": 709, "objenesis": 5669, "bin": 700, "https": 4046, "nodep": 5489, "zip": 9996, "cglib": 1058, "loc": 4831, "com": 1347, "sf": 8131, "junit": 4647, "easymock": 2229, "var": 9742, "kind": 4698, "tomcat_libs_base": 9022, "classpathentry": 1204, "build": 839, "maven": 5006, "deploy": 1975, "asf": 407, "release": 6880, "download": 2188, "page": 5902, "cgi": 1054, "doc": 2153, "latest": 4733, "branch": 775, "documentation": 2161, "date": 1768, "trunk": 9123, "current": 1733, "href": 4014, "html": 4016, "monitoring": 5272, "howto": 4006, "computer": 1429, "installed": 4227, "install": 4226, "later": 4732, "process": 6391, "jcp": 4572, "specifications": 8354, "community": 1382, "www": 9965, "dbcp": 1776, "commons": 1380, "tc": 8841, "version_major_minor": 9775, "version_major": 9774, "repos": 7003, "svn": 8746, "foundation": 2863, "visit": 9791, "reporting": 7001, "conduct": 1444, "getinvolved": 3368, "policies": 6183, "guide": 3871, "bugreport": 836, "review": 7207, "lists": 4814, "free": 2892, "ask": 408, "dev": 2054, "github": 3836, "software": 8314, "tcnative": 8845, "core": 1646, "jdt": 4578, "eclipse": 2239, "click": 1235, "license": 4769, "en": 2285, "resources": 7123, "users": 9647, "dedicated": 1825, "channel": 1077, "available": 581, "faq": 2632, "native": 5360, "ajp": 225, "config": 1448, "httpd": 4041, "daemon": 1752, "setup": 8104, "description": 2009, "action": 111, "filename": 2678, "dist": 2140, "archive": 376, "show_bug": 8149, "id": 4067, "bugzilla": 838, "bz": 877, "docs": 2157, "mod_expires": 5250, "remote": 6910, "replaces": 6977, "apparent": 309, "mod_remoteip": 5252, "gb74d21b8898b7c40bf7fd07ad3eb993d": 2939, "rely": 6899, "election": 2256, "jpg": 4599, "receive": 6738, "initiate": 4201, "br": 773, "arrives": 401, "tribes": 9104, "port": 6257, "revision": 7209, "viewvc": 9786, "view": 9784, "misc": 5230, "xmlencodingdetector": 9975, "bcel": 657, "library": 4768, "webservices": 9856, "modules": 5268, "r285186": 6614, "beanutils": 668, "struts": 8684, "oro": 5838, "index": 4153, "regex": 6835, "discuss": 2119, "mail": 4916, "want": 9810, "fileupload": 2690, "repo": 6993, "maven2": 5007, "hamcrest": 3893, "h2": 3879, "xsl": 9988, "db": 1773, "project": 6446, "gz": 3872, "tar": 8831, "param": 5917, "amp": 281, "buglink": 835, "rev": 7204, "select": 7454, "rat": 6633, "logs": 4884, "jvm": 4648, "startpath": 8600, "serviceinstalllog": 7574, "tomcatservicename": 9031, "displayname": 2137, "tomcatservicefilename": 9030, "filewrite": 2691, "instdir": 4255, "nsexec": 5608, "li": 4764, "changelog": 1071, "deployer": 1982, "dd": 1782, "extras": 2590, "instructions": 4258, "listeners": 4807, "optional": 5806, "cobertura": 1311, "text": 8892, "simpledateformat": 8187, "fasthttpdateformat": 2640, "rfc1123_date": 7218, "date_one": 1769, "private": 6369, "format": 2844, "final": 2723, "boolean": 755, "isopen": 4455, "getsocket": 3715, "atomiclong": 485, "generation": 2958, "creates": 1700, "nonce": 5520, "setting": 8083, "juli": 4646, "likely": 4785, "lead": 4741, "specified": 8355, "stopped": 8633, "changing": 1076, "logfactory": 4862, "issues": 4490, "loader": 4822, "methodname": 5191, "restriction": 7164, "apply": 345, "object": 5654, "bytebuffer": 863, "dowrite": 2189, "isdeferredsyntaxallowedasliteral": 4418, "match": 4992, "elsupport": 2272, "coercetostring": 1328, "copied": 1636, "input": 4212, "interfaces": 4273, "implemented": 4109, "reader": 6666, "copylarge": 1640, "writer": 9928, "opensslsessioncontext": 5786, "sessioncontext": 7636, "encoded": 2301, "like": 4784, "supplied": 8724, "caller": 925, "defaultpooledobject": 1892, "pps": 6287, "pcs": 6055, "sets": 8005, "saved": 7339, "reference": 6813, "super": 8719, "sql": 8368, "resultsettype": 7175, "resultsetconcurrency": 7171, "utils": 9678, "disconnectsqlcodes": 2118, "disconnection_sql_codes": 2116, "codes": 1318, "starting": 8595, "states": 8616, "getdisconnectsqlcodes": 3240, "compared": 1391, "given": 3837, "pooledconnectionimpl": 6218, "pstmtkey": 6526, "genericobjectpoolconfig": 2965, "abandonedconfig": 48, "poolconfig": 6213, "void": 9795, "updatejmxname": 9532, "generickeyedobjectpoolconfig": 2963, "delegatingpreparedstatement": 1946, "src": 8381, "dbcp2": 1777, "proper": 6459, "main": 4918, "tracks": 9065, "volatile": 9797, "tracing": 9060, "lastused": 4728, "initialize": 4192, "construct": 1554, "objects": 5666, "extend": 2574, "children": 1152, "glenn": 3838, "abandoned": 47, "author": 567, "statement": 8607, "abandonedtrace": 49, "connections": 1504, "nielsen": 5448, "resultset": 7170, "parent": 5954, "ms": 5292, "protected": 6486, "trace": 9056, "setlastused": 7864, "currenttimemillis": 1738, "traced": 9057, "synchronized": 8792, "tracelist": 9058, "clear": 1217, "result": 7165, "iter": 4514, "ref": 6806, "weakreference": 9829, "child": 1150, "equals": 2383, "remove": 6926, "managementfactory": 4939, "management": 4938, "jmexception": 4582, "instancealreadyexistsexception": 4231, "mbeanregistrationexception": 5084, "notcompliantmbeanexception": 5565, "em": 2273, "requirements": 7072, "packages": 5891, "pool2": 6205, "stop": 8631, "configured": 1465, "verbeeck": 9761, "solution": 8316, "craig": 1675, "dirk": 2097, "mcclanahan": 5102, "provides": 6512, "getlogwriter": 3435, "invoked": 4357, "effect": 2245, "following": 2823, "note": 5569, "getconnection": 3160, "setlogwriter": 7878, "getlogintimeout": 3434, "initialized": 4193, "defaultautocommit": 1877, "setlogintimeout": 7877, "commit": 1376, "auto": 575, "defaultreadonly": 1898, "unknown_transactionisolation": 9470, "poolableconnectionfactory": 6209, "defaulttransactionisolation": 1910, "int": 4260, "driver": 2195, "means": 5113, "defaultquerytimeout": 1897, "transaction": 9070, "obtain": 5676, "setdefaultquerytimeout": 7779, "isolation": 4454, "public": 6530, "flag": 2792, "caching": 906, "pooled": 6215, "defaultcatalog": 1878, "database": 1756, "controls": 1608, "catalog": 990, "cachestate": 905, "setdriverclassname": 7800, "getter": 3772, "returns": 7199, "setdriver": 7799, "taken": 8828, "lifo": 4783, "driverclassname": 2198, "order": 5816, "queue": 6594, "idle": 4079, "borrowobject": 766, "fifo": 2666, "behaves": 680, "driverclassloader": 2197, "limit": 4786, "allocated": 245, "active": 121, "negative": 5384, "maximum": 5039, "maxtotal": 5064, "total": 9047, "vary": 9755, "immediately": 4101, "maxidle": 5035, "good": 3847, "heavily": 3974, "excess": 2477, "point": 6170, "indicates": 4158, "possible": 6270, "opening": 5767, "loaded": 4821, "ones": 5729, "destroyed": 2033, "extra": 2585, "low": 4904, "best": 686, "systems": 8798, "faster": 2638, "opened": 5766, "remain": 6901, "timebetweenevictionrunsmillis": 8939, "minidle": 5215, "unless": 9474, "runs": 7302, "ensure": 2348, "evictor": 2450, "positive": 6269, "attempts": 498, "minimum": 5220, "connectionpool": 1499, "initial": 4185, "setminidle": 7909, "started": 8592, "default_max_wait_millis": 1853, "zero": 9995, "baseobjectpoolconfig": 637, "initialsize": 4198, "milliseconds": 5209, "size": 8214, "equal": 2382, "throwing": 8929, "maxwaitmillis": 5068, "wait": 9802, "make": 4928, "prepared": 6317, "callable": 914, "preparedstatements": 6321, "statements": 8614, "callablestatements": 917, "pooling": 6231, "help": 3977, "detect": 2045, "produced": 6435, "preparestatement": 6328, "maxopenpreparedstatements": 5045, "poolingstatements": 6235, "usually": 9663, "preparecall": 6316, "uses": 9648, "default_max_total": 1851, "limits": 4789, "borrow": 761, "maxopenstatements": 5046, "creation": 1712, "validated": 9699, "indication": 4160, "validate": 9697, "triggered": 9109, "soon": 8320, "testoncreate": 8882, "determines": 2052, "borrowed": 762, "attempt": 495, "dropped": 2204, "testonborrow": 8881, "testonreturn": 8883, "run": 7295, "default_time_between_eviction_runs_millis": 1873, "numtestsperevictionrun": 5645, "examine": 2459, "default_num_tests_per_eviction_run": 1857, "eligible": 2268, "eviction": 2443, "sit": 8213, "minevictableidletimemillis": 5214, "default_min_evictable_idle_time_millis": 1854, "getsoftminevictableidletimemillis": 3721, "condition": 1441, "softminevictableidletimemillis": 8311, "takes": 8829, "assuming": 433, "default_soft_min_evictable_idle_time_millis": 1868, "parameter": 5928, "precedence": 6293, "constraint": 1552, "examined": 2460, "evictionpolicyclassname": 2448, "policy": 6184, "getminevictableidletimemillis": 3507, "default_eviction_policy_class_name": 1837, "including": 4134, "qualified": 6578, "evictionpolicy": 2447, "setevictionpolicyclassname": 7816, "testwhileidle": 8891, "source": 8331, "waiting": 9805, "password": 6016, "establish": 2423, "strong": 8682, "row": 7270, "validation": 9710, "username": 9641, "isvalid": 4504, "setusername": 8116, "validationquery": 9713, "validationquerytimeout": 9714, "executing": 2499, "executed": 2492, "seconds": 7425, "physical": 6130, "setvalidationquerytimeout": 8123, "accessible": 92, "array": 391, "getconnectioninitsqls": 3163, "trim": 9112, "collection": 1332, "connectioninitsqls": 1496, "length": 4757, "execute": 2490, "allowed": 252, "underlying": 9452, "granted": 3855, "permitted": 6089, "accesstounderlyingconnectionallowed": 96, "allows": 260, "poolguard": 6229, "lifetime": 4780, "getmaxconnlifetimemillis": 3463, "exceeded": 2465, "closes": 1289, "messages": 5180, "logexpiredconnections": 4861, "suppress": 8738, "maxconnlifetimemillis": 5024, "expired": 2554, "expire": 2553, "valid": 9694, "alternative": 277, "jmxname": 4585, "requested": 7041, "component": 1420, "registers": 6850, "register": 6836, "preference": 6306, "checked": 1120, "automatically": 579, "setautocommit": 7690, "enableautocommitonreturn": 2287, "gets": 3685, "rollbackonreturn": 7251, "committed": 1377, "rollback": 7249, "getdisconnectionsqlcodes": 3239, "disconnection": 2114, "fatal": 2642, "disconnection_sql_code_prefix": 2115, "overrides": 5875, "subsequent": 8701, "generate": 2948, "plus": 6164, "validations": 9715, "fast": 2637, "disconnectionsqlcodes": 2117, "signal": 8166, "fatally": 2643, "disconnected": 2113, "sql_state": 8369, "conditions": 1443, "marked": 4984, "considered": 1521, "exceptions": 2474, "defaults": 1900, "indicating": 4159, "previously": 6343, "thrown": 8930, "sqlexceptions": 8373, "factory": 2595, "variables": 9750, "fastfailvalidation": 2639, "included": 4130, "need": 5373, "logwriter": 4886, "necessary": 5372, "standardcharsets": 8574, "outputstreamwriter": 5869, "sqlexception": 8372, "createdatasource": 1684, "manage": 4936, "printwriter": 6366, "utf_8": 9671, "poolingdatasource": 6233, "pass": 6006, "login": 4872, "basicdatasource": 647, "unsupportedoperationexception": 9510, "connecting": 1482, "feature": 2647, "supported": 8727, "initializing": 4197, "logintimeout": 4877, "removeabandonedtimeout": 6929, "hold": 3987, "getnumidle": 3536, "identified": 4072, "getmaxtotal": 3490, "getremoveabandonedonborrow": 3657, "getremoveabandonedtimeout": 3659, "lt": 4907, "exceed": 2464, "ul": 9433, "removed": 6933, "getnumactive": 3534, "removal": 6925, "gt": 3866, "removeabandonedonmaintenance": 6928, "maintenance": 4923, "setremoveabandonedonmaintenance": 7989, "removeabandonedonborrow": 6927, "creating": 1711, "getremoveabandonedonmaintenance": 3658, "preparedstatement": 6320, "cleanup": 1216, "happens": 3920, "callablestatement": 916, "resets": 7089, "adds": 186, "traces": 9059, "overhead": 5872, "logabandoned": 4859, "aid": 224, "retain": 7179, "record": 6772, "recent": 6755, "debugging": 1790, "usagetracking": 9590, "implements": 4111, "configure": 1464, "enable": 2286, "retrieved": 7185, "setters": 8071, "added": 157, "connectionproperties": 1502, "clients": 1256, "invoke": 4356, "mbeanserver": 5087, "subsequently": 8702, "registeredjmxname": 6843, "acquire": 110, "releases": 6886, "unregistermbean": 9498, "stored": 8642, "try": 9135, "unregister": 9495, "mbs": 5096, "getplatformmbeanserver": 3600, "finally": 2727, "runtimeexception": 7304, "capacity": 960, "requesting": 7054, "effectively": 2247, "manually": 4959, "invalidates": 4317, "internal": 4277, "driverconnectionfactory": 2199, "poolpreparedstatements": 6238, "setmaxopenpreparedstatements": 7897, "setpoolstatements": 7962, "previous": 6342, "algorithm": 235, "drivermanager": 2200, "currentthread": 1737, "getcontextclassloader": 3183, "connect": 1480, "connectionfactory": 1492, "deferred": 1917, "replace": 6970, "ds": 2205, "timer": 8951, "setjmxenabled": 7849, "subclasses": 8695, "registered": 6842, "configures": 1470, "poolableconnection": 6208, "genericobjectpool": 2964, "exists": 2518, "actual": 127, "objectname": 5662, "requestedname": 7046, "oname": 5719, "complete": 1407, "registermbean": 6846, "registration": 6856, "preregister": 6329, "ignored": 4088, "stringbuilder": 8674, "tostring": 9044, "bean": 661, "strings": 8678, "requires": 7073, "semi": 7469, "types": 9154, "names": 5343, "refaddr": 6810, "prop_cachestate": 6456, "form": 2839, "map": 4960, "output": 5856, "appear": 314, "expected": 2537, "references": 6818, "obsolete": 5675, "guarantee": 3867, "linkedhashmap": 4797, "nuprop_warntext": 5646, "know": 4701, "prop_default_querytimeout": 6457, "prop_disconnection_sql_codes": 6458, "props": 6483, "block": 732, "possibly": 6272, "getobjectinstance": 3539, "obj": 5651, "location": 4849, "hashtable": 3932, "environment": 2369, "namectx": 5332, "unknown": 9468, "append": 316, "propertyname": 6467, "warnings": 9818, "provided": 6508, "infomessages": 4172, "keyset": 4686, "propertyvalue": 6475, "isempty": 4426, "getobject": 3538, "ignoring": 4090, "serializable": 7533, "equalsignorecase": 2384, "propertynames": 6468, "getproperties": 3627, "nextelement": 5440, "hasmoreelements": 3935, "getproperty": 3628, "enumeration": 2366, "delimited": 1956, "character": 1091, "proptext": 6484, "parse": 5970, "bytearrayinputstream": 860, "delimiter": 1957, "iso_8859_1": 4453, "getbytes": 3062, "separate": 7522, "rodney": 7241, "specific": 8351, "waldhoff": 9808, "fashion": 2636, "constants": 1547, "uname": 9437, "datasourceconnectionfactory": 1764, "delegatingconnection": 1944, "setbinarystream": 7695, "scale": 7372, "getdouble": 3246, "delegate": 1937, "getarray": 3008, "calendar": 913, "seturl": 8109, "interface": 4271, "registeroutparameter": 6847, "getlong": 3436, "extends": 2576, "getfloat": 3300, "setboolean": 7699, "setasciistream": 7683, "setobject": 7925, "settime": 8078, "gettime": 3780, "tracking": 9064, "val": 9689, "setbytes": 7703, "setfloat": 7826, "setint": 7843, "setstring": 8062, "typename": 9152, "getclob": 3135, "handleexception": 3900, "setdouble": 7798, "getblob": 3043, "gettimestamp": 3783, "james": 4524, "house": 4005, "setbyte": 7702, "getbyte": 3060, "short": 8147, "checkopen": 1128, "getboolean": 3052, "parameterindex": 5933, "getdelegate": 3224, "bigdecimal": 697, "ensures": 2349, "blob": 731, "setlong": 7879, "targetsqltype": 8837, "cal": 908, "setshort": 8024, "getrowid": 3681, "getref": 3647, "getshort": 3712, "getbigdecimal": 3040, "paramindex": 5944, "wasnull": 9822, "setcharacterstream": 7719, "clob": 1258, "delegatingcallablestatement": 1943, "setdate": 7765, "settimestamp": 8081, "getint": 3361, "geturl": 3806, "setbigdecimal": 7694, "getstring": 3765, "timestamp": 8954, "simply": 8195, "corresponding": 1650, "setnull": 7923, "getdate": 3208, "parametername": 5937, "float": 2798, "constructor": 1556, "sqltype": 8376, "setrowid": 8004, "setnstring": 7922, "setncharacterstream": 7912, "setnclob": 7913, "setclob": 7733, "setblob": 7696, "getnclob": 3520, "setsqlxml": 8033, "getsqlxml": 3725, "getnstring": 3533, "getncharacterstream": 3519, "getcharacterstream": 3105, "type": 9150, "emptymap": 2284, "_autocommitcached": 0, "recycle": 6784, "older": 5713, "collections": 1335, "_cachestate": 2, "_closed": 4, "representation": 7007, "_readonlycached": 26, "_conn": 8, "metadata": 5184, "ex": 2453, "compare": 1388, "genuine": 2969, "api": 301, "chain": 1063, "break": 776, "traversing": 9095, "recursively": 6779, "signature": 8168, "backwards": 614, "instanceof": 4244, "ways": 9827, "sure": 8742, "compatibility": 1395, "invokes": 4358, "getdelegateinternal": 3225, "useful": 9609, "sub": 8693, "equivalent": 2385, "appropriate": 347, "wrapped": 9893, "setdelegate": 7790, "override": 5874, "getquerytimeout": 3638, "intvalue": 4308, "setquerytimeout": 7975, "delegatingstatement": 1948, "createstatement": 1706, "dps": 2192, "booleanvalue": 756, "getwarnings": 3824, "getcatalog": 3074, "accessed": 90, "isreadonly": 4463, "known": 4702, "valueof": 9735, "clearwarnings": 1234, "directly": 2093, "delegatingdatabasemetadata": 1945, "nativesql": 5361, "dcs": 1781, "getmetadata": 3502, "cached": 896, "getautocommit": 3028, "setcatalog": 7710, "settransactionisolation": 8093, "readonly": 6688, "settypemap": 8102, "setreadonly": 7978, "isclosed": 4405, "activate": 116, "savepoint": 7346, "setsavepoint": 8006, "holdability": 3988, "releasesavepoint": 6887, "resultsetholdability": 7172, "getholdability": 3318, "setholdability": 7834, "autogeneratedkeys": 577, "columnindexes": 1343, "iswrapperfor": 4509, "columnnames": 1346, "iface": 4085, "isassignablefrom": 4389, "getclass": 3120, "cast": 974, "unwrap": 9516, "elements": 2263, "sqlclientinfoexception": 8370, "setclientinfo": 7732, "getclientinfo": 3134, "setschema": 8008, "schema": 7385, "executor": 2503, "setnetworktimeout": 7916, "meta": 5182, "remaining": 6903, "_meta": 22, "delegating": 1942, "databasemetadata": 1757, "delegatingresultset": 1947, "getbestrowidentifier": 3039, "wrapresultset": 9900, "table": 8804, "scope": 7394, "nullable": 5618, "getattributes": 3017, "typenamepattern": 9153, "deletesaredetected": 1952, "schemapattern": 7387, "getcatalogseparator": 3075, "getcolumns": 3144, "columnnamepattern": 1345, "assertionerror": 417, "tablenamepattern": 8805, "getcolumnprivileges": 3143, "getcatalogterm": 3076, "foreigncatalog": 2835, "parenttable": 5966, "foreigntable": 2837, "getcrossreference": 3199, "foreignschema": 2836, "parentcatalog": 5956, "parentschema": 5961, "getdatabaseminorversion": 3205, "getdatabaseproductname": 3206, "getexportedkeys": 3282, "getdatabasemajorversion": 3204, "getdatabaseproductversion": 3207, "getdefaulttransactionisolation": 3221, "getdriverversion": 3249, "getdrivername": 3248, "getimportedkeys": 3339, "getidentifierquotestring": 3333, "getextranamecharacters": 3285, "unique": 9465, "getindexinfo": 3342, "getmaxcolumnsingroupby": 3456, "getmaxschemanamelength": 3483, "getmaxstatements": 3485, "getprimarykeys": 3618, "getmaxcolumnsintable": 3460, "getmaxtablesinselect": 3488, "getmaxcatalognamelength": 3453, "getmaxcharliterallength": 3454, "getmaxcolumnnamelength": 3455, "getmaxstatementlength": 3484, "getjdbcminorversion": 3381, "getmaxtablenamelength": 3487, "getmaxcursornamelength": 3465, "getmaxcolumnsinorderby": 3458, "getmaxindexlength": 3474, "getmaxprocedurenamelength": 3479, "getmaxcolumnsinselect": 3459, "getmaxcolumnsinindex": 3457, "getmaxrowsize": 3481, "getmaxbinaryliterallength": 3452, "getjdbcmajorversion": 3380, "getnumericfunctions": 3535, "getmaxconnections": 3462, "getmaxusernamelength": 3493, "procedurenamepattern": 6385, "getprocedurecolumns": 3623, "getprocedures": 3624, "getprocedureterm": 3625, "getschemas": 3686, "getresultsetholdability": 3676, "getusername": 3814, "nullplusnonnullisnull": 5621, "nullsaresortedlow": 5628, "othersdeletesarevisible": 5846, "useslocalfiles": 9654, "supportsresultsetholdability": 8734, "nullsaresortedatend": 5625, "useslocalfilepertable": 9653, "owninsertsarevisible": 5881, "supportsresultsetconcurrency": 8733, "owndeletesarevisible": 5879, "ownupdatesarevisible": 5883, "updatesaredetected": 9538, "nullsaresortedatstart": 5626, "supportstransactionisolationlevel": 8736, "insertsaredetected": 4224, "supportsconvert": 8732, "nullsaresortedhigh": 5627, "othersupdatesarevisible": 5848, "totype": 9048, "fromtype": 2898, "othersinsertsarevisible": 5847, "supportsresultsettype": 8735, "getfunctions": 3305, "functionnamepattern": 2918, "getfunctioncolumns": 3304, "executequery": 2496, "clearparameters": 1225, "setunicodestream": 8103, "executeupdate": 2498, "addbatch": 149, "resultsetmetadata": 7173, "setarray": 7682, "setref": 7982, "getparametermetadata": 3559, "stmt": 8628, "_stmt": 34, "_res": 27, "res": 7076, "rset": 7285, "wrap": 9892, "conn": 1479, "getconcurrency": 3154, "removetrace": 6949, "getbinarystream": 3042, "direction": 2089, "updatecharacterstream": 9528, "rowupdated": 7275, "updatebytes": 9527, "beforefirst": 673, "updateboolean": 9525, "refreshrow": 6829, "islast": 4445, "updatebyte": 9526, "updateclob": 9529, "movetoinsertrow": 5285, "updatebigdecimal": 9522, "columnindex": 1342, "removes": 6944, "cancelrowupdates": 943, "getasciistream": 3009, "updatebinarystream": 9523, "rowdeleted": 7271, "findcolumn": 2739, "rowinserted": 7273, "updateblob": 9524, "updateasciistream": 9521, "sqlwarning": 8377, "setfetchsize": 7823, "gettype": 3799, "getfetchdirection": 3292, "updatearray": 9520, "getcursorname": 3202, "setfetchdirection": 7822, "original": 5830, "rows": 7274, "movetocurrentrow": 5283, "getfetchsize": 3293, "columnlabel": 1344, "updaterowid": 9536, "updatenstring": 9535, "updatenclob": 9534, "updatesqlxml": 9539, "updatencharacterstream": 9533, "address": 183, "getname": 3515, "resultsets": 7174, "passivate": 6009, "setmaxfieldsize": 7887, "setmaxrows": 7901, "max": 5008, "getmaxrows": 3480, "setcursorname": 7762, "setescapeprocessing": 7815, "getmaxfieldsize": 3467, "cancel": 938, "getresultsetconcurrency": 3675, "getmoreresults": 3513, "getresultsettype": 3677, "getgeneratedkeys": 3306, "setpoolable": 7960, "poolable": 6206, "connecturi": 1516, "normally": 5545, "subprotocol": 8700, "drivermanagerconnectionfactory": 2201, "arbitrary": 373, "lifetimeexceededexception": 4782, "_resultsetconcurrency": 28, "stmttype": 8630, "_sql": 33, "_autogeneratedkeys": 1, "builder": 842, "prepared_statement": 6318, "callable_statement": 915, "keys": 4685, "_resultsettype": 30, "column": 1340, "_columnindexes": 6, "defining": 1928, "_catalog": 3, "_columnnames": 7, "statementtype": 8615, "_resultsetholdability": 29, "_stmttype": 35, "prime": 6349, "hashcode": 3929, "buf": 791, "poolingconnection": 6232, "getconnectioninternal": 3164, "poolablecallablestatement": 6207, "prepare": 6315, "_pool": 24, "_key": 21, "op": 5753, "obtained": 5677, "retrieval": 7183, "keyedobjectpool": 4674, "returnobject": 7197, "instancenotfoundexception": 4243, "objectpool": 5665, "mbean_server": 5076, "validationpreparedstatement": 9712, "_disconnectionsqlcodes": 16, "indicate": 4157, "future": 2920, "broken": 783, "_fastfailvalidation": 18, "_fatalsqlexceptionthrown": 19, "longer": 4888, "determine": 2050, "required": 7070, "ise": 4423, "invalidateobject": 4316, "ignore": 4087, "expose": 2562, "argument": 386, "successfully": 8710, "resulting": 7167, "rs": 7283, "getinnermostdelegateinternal": 3352, "sqlstate": 8375, "startswith": 8602, "connfactory": 1517, "_connectioninitsqls": 9, "datasourcejmxname": 1765, "pooledobjectfactory": 6223, "_validationquerytimeout": 40, "_validationquery": 39, "validateobject": 9703, "activation": 120, "_connfactory": 10, "newly": 5423, "_defaultautocommit": 12, "getlog": 3430, "turns": 9145, "_defaulttransactionisolation": 15, "_defaultreadonly": 14, "_defaultcatalog": 13, "passivation": 6013, "createconnection": 1680, "poolstatements": 6241, "generickeyedobjectpool": 2962, "pc": 6049, "stmtpool": 8629, "setcachestate": 7706, "connjmxname": 1519, "connindex": 1518, "setstatementpool": 8060, "sqls": 8374, "pooledobject": 6222, "destroyobject": 2039, "debug": 1788, "getmessage": 3499, "passivateobject": 6011, "lifetimeexceeded": 4781, "activateobject": 118, "validatelifetime": 9702, "default_max_total_per_key": 1852, "defines": 1925, "exposed": 2563, "instances": 4245, "poolablepreparedstatement": 6210, "_pstmtpool": 25, "oldpool": 5715, "actually": 128, "pull": 6544, "keyedpooledobjectfactory": 4677, "unused": 9513, "define": 1920, "normalizesql": 5544, "reached": 6644, "occurred": 5683, "createkey": 1690, "nosuchelementexception": 5554, "producing": 6437, "field": 2660, "canonical": 952, "activated": 117, "getstmttype": 3758, "enum": 2364, "suppresswarnings": 8740, "activating": 119, "getinnermostdelegate": 3351, "normalize": 5541, "destroying": 2037, "rawtypes": 6637, "makeobject": 4929, "trimmed": 9114, "validating": 9708, "unchecked": 9444, "passivating": 6012, "semantically": 7467, "simple": 8186, "obtains": 5679, "getfactory": 3286, "fix": 2786, "verify": 9765, "pcf": 6050, "rte": 7290, "getpool": 3605, "unsupported": 9505, "according": 99, "interruptedexception": 4297, "poolguardconnectionwrapper": 6230, "makes": 4930, "isaccesstounderlyingconnectionallowed": 4384, "getconnectionpool": 3166, "substring": 8705, "hashmap": 3930, "pools": 6240, "registerpool": 6848, "invalidate": 4314, "pgconn": 6127, "invalidating": 4318, "logger": 4865, "turned": 9143, "swallowedexceptionlogger": 8758, "swallowedexceptionlistener": 8757, "onswallowedexception": 5740, "is_security_enabled": 4380, "resourcebundle": 7109, "getbundle": 3058, "getpackage": 3553, "getsecuritymanager": 3688, "disconnect": 2112, "closequietly": 1284, "i18n": 4060, "replaced": 6972, "correct": 1647, "args": 384, "msg": 5296, "placeholders": 6153, "specification": 8353, "mcnally": 5103, "john": 4596, "accordance": 98, "wrappers": 9898, "connectionimpl": 1495, "pooledconnection": 6216, "notifies": 5583, "marks": 4989, "driveradaptercpds": 2196, "attached": 491, "drivers": 2202, "j2ee": 4520, "generally": 2947, "getters": 3773, "general": 2945, "get_connection_called": 2973, "getconnectioncalled": 3161, "sharedpooldatasource": 8143, "deploying": 1984, "summary": 8717, "objectfactory": 5659, "shows": 8153, "connectionpooldatasource": 1500, "presented": 6333, "instantiated": 4251, "implementations": 4108, "experimental": 2549, "referenceable": 6816, "adapter": 143, "testing": 8880, "transient": 9083, "pstmtkeycpds": 6527, "workaround": 9886, "settings": 8084, "pci": 6051, "classcircularityerror": 1184, "setaccesstounderlyingconnectionallowed": 7673, "cleared": 1219, "impl": 4104, "getpooledconnection": 3606, "functionality": 2915, "invocation": 4353, "getmaxpreparedstatements": 3478, "getnumtestsperevictionrun": 3537, "getmaxidle": 3471, "gettimebetweenevictionrunsmillis": 3781, "stringrefaddr": 8677, "maxpreparedstatements": 5050, "getpassword": 3568, "env": 2367, "refobj": 6827, "setpoolpreparedstatements": 7961, "ra": 6619, "getcontent": 3177, "setminevictableidletimemillis": 7908, "parseint": 5984, "settimebetweenevictionrunsmillis": 8079, "setmaxpreparedstatements": 7900, "setnumtestsperevictionrun": 7924, "overwrite": 5877, "setuser": 8114, "setpassword": 7935, "present": 6332, "containskey": 1572, "filled": 2692, "internally": 4283, "setproperty": 7969, "setdescription": 7791, "assign": 423, "classnotfoundexception": 1201, "attempting": 497, "released": 6883, "th": 8896, "tt": 9138, "ceil": 1013, "roughly": 7265, "tests": 8886, "tested": 8872, "stringbuffer": 8673, "getsql": 3724, "pstmtpool": 6528, "statementeventlisteners": 8613, "vector": 9758, "attempted": 496, "statementeventlistener": 8612, "logical": 4871, "event": 2436, "checks": 1135, "gc": 2940, "throwable": 8928, "listener": 4805, "reused": 7203, "removestatementeventlistener": 6946, "connectionclosed": 1484, "finalize": 2725, "sends": 7510, "inheritdoc": 4177, "tries": 9107, "occur": 5681, "connectioneventlistener": 1490, "contain": 1562, "ppss": 6288, "getautogeneratedkeys": 3029, "_rollbackaftervalidation": 31, "_username": 38, "muted": 5317, "issued": 4488, "concurrenthashmap": 1436, "rollbackaftervalidation": 7250, "no_key_message": 5475, "pooledconnectionandinfo": 6217, "_password": 23, "_cpds": 11, "cpdsconnectionfactory": 1671, "pooledconnectionmanager": 6219, "cpds": 1670, "newsetfrommap": 5429, "pooledconnections": 6220, "validatingset": 9709, "pcmap": 6052, "came": 932, "err": 2387, "println": 6362, "getsource": 3723, "appropriately": 348, "counters": 1660, "come": 1351, "update": 9519, "kill": 4697, "managed": 4937, "matches": 4995, "closepool": 1283, "abstract": 58, "datasourcename": 1766, "instancekey": 4235, "constant": 1523, "setdatasourcename": 7764, "instancekeydatasource": 4236, "shared": 8142, "particular": 6000, "default_min_idle_per_key": 1855, "declared": 1797, "supply": 8725, "peruserpooldatasource": 6116, "outside": 5870, "jndienvironment": 4593, "direct": 2088, "manner": 4957, "defaulttimebetweenevictionrunsmillis": 1909, "defined": 1923, "assertinitializationallowed": 416, "maintained": 4922, "getblockwhenexhausted": 3048, "blockwhenexhausted": 740, "getlifo": 3418, "setdefaultevictionpolicyclassname": 7771, "getevictionpolicyclassname": 3277, "getmaxidleperkey": 3472, "getmaxtotalperkey": 3491, "getmaxwaitmillis": 3495, "getminidleperkey": 3509, "setdefaultminevictableidletimemillis": 7776, "setdefaultsoftminevictableidletimemillis": 7781, "gettestoncreate": 3774, "gettestonreturn": 3775, "gettestwhileidle": 3776, "setdefaulttimebetweenevictionrunsmillis": 7786, "backing": 606, "getdefaulttimebetweenevictionrunsmillis": 3220, "backs": 611, "backend": 600, "provider": 6509, "look": 4891, "changed": 1069, "setconnectionpooldatasource": 7748, "handed": 3895, "drive": 2194, "dependent": 1972, "serves": 7569, "tools": 9039, "purpose": 6548, "gui": 3870, "locate": 4847, "initialcontext": 4187, "instantiating": 4252, "assigned": 425, "retrieve": 7184, "succeeds": 8707, "comparison": 1393, "old": 5705, "getpooledconnectionandinfo": 3607, "encountered": 2318, "testcpds": 8871, "ne": 5370, "reset": 7086, "upkey": 9555, "setupdefaults": 8105, "exc": 2463, "handling": 3909, "illegal": 4093, "instancemap": 4242, "iterator": 4518, "hasnext": 3938, "ready": 6712, "getvalue": 3821, "entryset": 2362, "serialized": 7539, "setdefaulttransactionisolation": 7787, "setdefaultminidle": 7777, "setcommonproperties": 7740, "setdefaultmaxtotal": 7774, "setdefaultlifo": 7772, "setdefaulttestwhileidle": 7785, "setmaxconnlifetimemillis": 7885, "maxidleperkey": 5037, "setdefaultmaxidle": 7773, "maxtotalperkey": 5065, "minidleperkey": 5216, "deserialize": 2016, "getnewinstance": 3524, "setdefaultnumtestsperevictionrun": 7778, "setrollbackaftervalidation": 8002, "setdefaulttestoncreate": 7783, "setdefaulttestonreturn": 7784, "contained": 1563, "setdefaultmaxwaitmillis": 7775, "parselong": 5985, "setdefaulttestonborrow": 7782, "setdefaultreadonly": 7780, "setdefaultblockwhenexhausted": 7769, "subclass": 8694, "setdefaultautocommit": 7768, "setvalidationquery": 8122, "keyedcpdsconnectionfactory": 4673, "case3": 971, "setpool": 7959, "userpasskey": 9642, "credentials": 1719, "pconn": 6054, "getuserpasskey": 3815, "perusertimebetweenevictionrunsmillis": 6123, "passwords": 6018, "perusertestoncreate": 6120, "getperuserblockwhenexhausted": 3581, "peruserdefaulttransactionisolation": 6107, "specifically": 8352, "perusertestwhileidle": 6122, "options": 5812, "perusermaxwaitmillis": 6112, "individual": 4163, "peruserdefaultautocommit": 6105, "peruserdefaultreadonly": 6106, "perusertestonreturn": 6121, "existing": 2517, "deployment": 1985, "certain": 1020, "processed": 6399, "peruserminevictableidletimemillis": 6113, "peruserevictionpolicyclassname": 6108, "track": 9061, "serialization": 7537, "peruserlifo": 6109, "arg": 383, "perusertestonborrow": 6119, "mapped": 4968, "peruserblockwhenexhausted": 6104, "managers": 4946, "perusermaxtotal": 6111, "perusersoftminevictableidletimemillis": 6118, "perusernumtestsperevictionrun": 6115, "peruserminidle": 6114, "perusermaxidle": 6110, "poolkey": 6236, "setperuserblockwhenexhausted": 7938, "userdefaultblockwhenexhausted": 9620, "getperuserevictionpolicyclassname": 3585, "putall": 6566, "getperuserlifo": 3586, "userdefaultevictionpolicyclassname": 9621, "setperuserevictionpolicyclassname": 7942, "getperusermaxidle": 3587, "userdefaultlifo": 9622, "setperuserlifo": 7943, "getperusermaxtotal": 3588, "userdefaultmaxidle": 9623, "setperusermaxidle": 7944, "userdefaultmaxtotal": 9624, "setperusermaxtotal": 7945, "getperusermaxwaitmillis": 3589, "getperuserminevictableidletimemillis": 3590, "userdefaultmaxwaitmillis": 9625, "setperusermaxwaitmillis": 7946, "userdefaultminevictableidletimemillis": 9626, "setperuserminevictableidletimemillis": 7947, "count": 1655, "getminidle": 3508, "getperuserminidle": 3591, "getperusernumtestsperevictionrun": 3592, "setperuserminidle": 7948, "userdefaultminidle": 9627, "getperusersoftminevictableidletimemillis": 3593, "setperusernumtestsperevictionrun": 7949, "userdefaultnumtestsperevictionrun": 9628, "setperusersoftminevictableidletimemillis": 7950, "userdefaultsoftminevictableidletimemillis": 9630, "getperusertestoncreate": 3595, "userdefaulttestonreturn": 9633, "getperuserdefaultreadonly": 3583, "setperusertestwhileidle": 7954, "getperusertestonreturn": 3596, "userdefaulttestwhileidle": 9634, "getpoolkey": 3608, "authentication": 555, "userdefaulttestonborrow": 9631, "setperuserdefaultreadonly": 7940, "getperuserdefaulttransactionisolation": 3584, "getperusertimebetweenevictionrunsmillis": 3598, "userdefaulttimebetweenevictionrunsmillis": 9635, "userdefaulttestoncreate": 9632, "getperusertestonborrow": 3594, "setperusertestoncreate": 7952, "setperusertimebetweenevictionrunsmillis": 7955, "userdefaultautocommit": 9619, "userdefaultreadonly": 9629, "setperuserdefaultautocommit": 7939, "works": 9890, "setperusertestonborrow": 7951, "getperusertestwhileidle": 3597, "usermax": 9640, "setperuserdefaulttransactionisolation": 7941, "inherited": 4178, "longvalue": 4890, "userdefaulttransactionisolation": 9636, "getperuserdefaultautocommit": 3582, "setperusertestonreturn": 7953, "setmaxwaitmillis": 7905, "objectinputstream": 5660, "setswallowedexceptionlistener": 8065, "supports": 8731, "readobject": 6686, "setblockwhenexhausted": 7698, "peruserpooldatasourcefactory": 6117, "getconnectionmanager": 3165, "settestoncreate": 8073, "mgr": 5202, "getvalidationquery": 3820, "happen": 3919, "passing": 6008, "setmaxtotal": 7903, "settestwhileidle": 8075, "settestonborrow": 8072, "oldds": 5712, "setmaxidle": 7892, "setlifo": 7868, "settestonreturn": 8074, "setsoftminevictableidletimemillis": 8030, "pupds": 6547, "sb": 7359, "pk": 6146, "immutable": 4102, "authenticating": 554, "invalidated": 4315, "belongs": 683, "share": 8141, "sharedpooldatasourcefactory": 8144, "tmppool": 8989, "spds": 8343, "keyed": 4672, "pair": 5907, "holds": 3990, "hash": 3927, "things": 8898, "poolingdriver": 6234, "assume": 428, "let": 4759, "primary": 6348, "lifecycle": 4771, "thing": 8897, "expect": 2534, "think": 8899, "ol": 5704, "pre": 6291, "softreferenceobjectpool": 8313, "wants": 9812, "walk": 9809, "addobject": 176, "keyedpool": 4675, "checking": 1125, "wrapping": 9899, "factor": 2594, "erodingobjectpool": 2386, "decorating": 1818, "basis": 649, "spent": 8362, "spend": 8361, "place": 6151, "served": 7544, "jmxnameprefix": 4587, "jmxregister": 4588, "jmxnamebase": 4586, "basegenericobjectpool": 635, "getconstructor": 3175, "newinstance": 5421, "clazz": 1207, "getevictionpolicy": 3276, "swallowexception": 8760, "swallowed": 8756, "oome": 5747, "virtualmachineerror": 9789, "onswallowexception": 5741, "outofmemoryerror": 5855, "vme": 9794, "skip": 8218, "timertask": 8952, "baseobject": 636, "cloneable": 1261, "evict": 2442, "evictionconfig": 2444, "undertest": 9453, "idlecount": 4080, "guardedby": 3869, "tracker": 9063, "evictiontimer": 2449, "usagecount": 9589, "task": 8839, "period": 6076, "prevent": 6339, "timeunit": 8955, "schedule": 7384, "delay": 1934, "unit": 9467, "startevictor": 8593, "setconfig": 7744, "markreturning": 4988, "getstate": 3755, "pooledobjectstate": 6224, "hastakewaiters": 3946, "idleobjects": 4081, "objectdeque": 5658, "clone": 1260, "destroys": 2041, "identify": 4075, "calculate": 909, "recover": 6774, "generic": 2960, "save": 7338, "serialize": 7538, "deque": 1997, "accuracy": 102, "disclaimer": 2111, "locks": 4856, "printstacktrace": 6365, "superclass": 8720, "getfactorytype": 3289, "getgenericinterfaces": 3307, "parameterizedtype": 5935, "explicit": 2558, "argtype": 385, "representing": 7009, "pi": 6131, "definition": 1929, "concrete": 1433, "getgenerictype": 3308, "pooledsoftreference": 6227, "points": 6173, "allreferences": 264, "userproperties": 9646, "sslengine": 8516, "createsslengine": 1705, "sslcontext": 8508, "getkeyproperty": 3398, "tccl": 8842, "cl": 1176, "nc": 5367, "javaw": 4569, "jre": 4600, "exe": 2488, "jre_home": 4602, "nojavahome": 5505, "exist": 2511, "goto": 3852, "java_home": 4559, "getremoteaddr": 3651, "proxies": 6513, "incoming": 4136, "internalproxies": 4289, "matcher": 4994, "stringmanager": 8675, "digester": 2081, "sm": 8248, "getmanager": 3439, "ipv4": 4370, "testtype": 8890, "sc": 7360, "netinbuffer": 5395, "handshakereadcompletionhandler": 3914, "td": 8850, "callbackhandlerimpl": 920, "authenticatorbase": 558, "basicauthenticator": 643, "digestauthenticator": 2076, "formauthenticator": 2850, "spnegoauthenticator": 8366, "authconfigfactoryimpl": 544, "applicationfilterconfig": 329, "standardwrapper": 8588, "corsfilter": 1653, "expiresfilter": 2557, "failedrequestfilter": 2609, "httpheadersecurityfilter": 4042, "remoteaddrfilter": 6913, "remotehostfilter": 6916, "requestdumperfilter": 7040, "setcharacterencodingfilter": 7718, "persistentmanagerbase": 6101, "abstractreplicatedmap": 73, "lazyreplicatedmap": 4738, "replicatedmap": 6985, "connectionsettingsbase": 1506, "jspreader": 4622, "sdeinstaller": 7407, "jspservletwrapper": 4627, "utf8reader": 9669, "tldparser": 8969, "webxml": 9861, "webxmlparser": 9862, "aprendpoint": 361, "acceptor": 83, "wsframeclient": 9950, "wsremoteendpointimplbase": 9956, "wssession": 9961, "wswebsocketcontainer": 9963, "pojoendpointbase": 6177, "wsframeserver": 9951, "wshttpupgradehandler": 9952, "wsremoteendpointimplserver": 9957, "persistentproviderregistrations": 6102, "delete": 1950, "jspruntimelibrary": 4624, "securityclassload": 7439, "mergelifecyclecallback": 5148, "iswebapp": 4507, "processmanifest": 6418, "stuckingservlet": 8688, "assert": 411, "assertfalse": 415, "httpservlet": 4048, "asserttrue": 422, "origins": 5834, "max_value": 5013, "dst": 2208, "attachment": 492, "handler": 3903, "getreadtimeout": 3642, "tonio2timeout": 9034, "nread": 5604, "iob": 4362, "eofexception": 2373, "getwritetimeout": 3834, "failedwrite": 2611, "nio2endpoint": 5452, "netoutbuffer": 5396, "endpoint": 2335, "getconnectiontimeout": 3167, "remainingdataduringclose": 6904, "flush": 2803, "skipuntil": 8230, "eof": 2372, "quality": 6579, "malformed": 4933, "lws": 4909, "skiplws": 8224, "char": 1090, "mark": 4982, "token": 9014, "handshakewritecompletionhandler": 3918, "getnio2writetimeout": 3529, "getnio2readtimeout": 3528, "writepending": 9922, "tryacquire": 9136, "socketbufferhandler": 8286, "getwritebuffer": 3829, "awaitbyteshandler": 591, "nio2": 5450, "writetimeout": 9932, "readtimeout": 6706, "microsystems": 5204, "title": 8962, "vendor": 9759, "annotations": 294, "servlets": 7613, "sun": 8718, "cluster": 1295, "ha": 3884, "quot": 6603, "jvmroutebindervalve": 4652, "messagereceived": 5179, "member": 5122, "getttl": 3798, "cachedresource": 897, "newcacheentry": 5408, "objectmaxsizebytes": 5661, "root": 7253, "dtd": 2211, "xmlschema": 9980, "javaee": 4564, "app": 306, "ns": 5605, "fragment": 2867, "w3": 9800, "app_2_3": 307, "doctype": 2158, "schemalocation": 7386, "xmlns": 9979, "xsd": 9986, "xsi": 9987, "mime": 5210, "role": 7243, "distributable": 2143, "icon": 4066, "display": 2136, "ejb": 2249, "welcome": 9865, "taglib": 8820, "mediante": 5117, "este": 2427, "todos": 9006, "fichero": 2656, "jspc": 4614, "elementos": 2262, "footer": 2830, "creado": 1677, "los": 4900, "fichier": 2658, "dans": 1754, "le": 4740, "ce": 1012, "control": 1606, "default_allowed_origins": 1827, "default_supports_credentials": 1870, "response_header_access_control_allow_origin": 7133, "servletexception": 7600, "dofilter": 2166, "presence": 6331, "tolowercase": 9020, "init": 4182, "english": 2347, "setheader": 7831, "getheader": 3313, "setmethod": 7907, "filterchain": 2704, "corsrequesttype": 1654, "getattribute": 3015, "allowedorigins": 255, "close_clean": 1264, "seterrorstate": 7814, "errorstate": 2406, "userdatahelper": 9618, "octet": 5690, "octetcount": 5691, "domainparsestate": 2176, "segmentindex": 7449, "numeric": 5643, "hyphen": 4059, "errorlocation": 2399, "allowsend": 262, "end": 2325, "allowscolon": 261, "alpha": 266, "iae": 4062, "foo": 2827, "bar": 626, "messagelength": 5173, "ajpprocessor": 231, "toolong": 9038, "setmanager": 7880, "resetdeltarequest": 7087, "listproperties": 4813, "paramname": 5945, "additional": 169, "adding": 164, "paramvalue": 5949, "params": 5947, "invalidenventrytype": 4329, "isdebugenabled": 4417, "decode": 1800, "invalidenventryvalue": 4330, "charat": 1096, "numberformatexception": 5640, "descriptor": 2011, "localejb": 4836, "malformedurlexception": 4935, "handlerref": 3904, "getservletcontext": 3704, "serviceref": 7576, "gethandler": 3310, "gethandlers": 3311, "carry": 969, "wsdl": 9947, "handlers": 3905, "namespaceuri": 5347, "wsdlfailed": 9948, "getresource": 3667, "resourceref": 7122, "getdescription": 3227, "resourceenvref": 7113, 